Tekla Open API Reference for Tekla Structures 2025
ContourPoint Constructor
Overload List
Name | Description
ContourPoint()
 Creates a new contour point instance.
ContourPoint(Point, Chamfer)
 Creates a new contour point using the given point and chamfer.
Top
See Also
Reference
ContourPoint Class
Tekla.Structures.Model Namespace